# Append Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionSegmentArray..::..Append Method
DimensionSegmentArray Class See Also
---
Add the item to the end of the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	DimensionSegment item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As DimensionSegment _
)
```

Visual C++
---
```text
public:
virtual void Append(
	DimensionSegment^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..DimensionSegmentThe item to be added.
# See Also
DimensionSegmentArray Class
Autodesk.Revit.DB Namespace